; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	spectrograph3 - mode
	infrared1 - mode
	spectrograph2 - mode
	image0 - mode
	thermograph4 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star0)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 Star4)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument6 spectrograph3)
	(supports instrument6 image0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 GroundStation1)
	(calibration_target instrument8 Star4)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument9 spectrograph3)
	(supports instrument9 infrared1)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 image0)
	(supports instrument10 spectrograph3)
	(calibration_target instrument10 Star4)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 GroundStation1)
	(calibration_target instrument11 GroundStation5)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star8)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(pointing satellite1 GroundStation3)
	(have_image Planet6 image0)
	(have_image Star7 thermograph4)
	(have_image Star8 thermograph4)
	(have_image Phenomenon9 image0)
	(have_image Phenomenon10 spectrograph2)
	(have_image Planet11 thermograph4)
	(have_image Star12 image0)
))

)

; plan
1. (turn_to satellite2 groundstation3 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 9
3. (calibrate satellite2 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 0 of 9
4. (turn_to satellite2 star12 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star12)
   goals met: 0 of 9
5. (take_image satellite2 star12 instrument6 image0)
   added: (have_image star12 image0)
   goals met: 1 of 9
6. (turn_to satellite2 planet6 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 planet6)
   goals met: 1 of 9
7. (take_image satellite2 planet6 instrument6 image0)
   added: (have_image planet6 image0)
   goals met: 2 of 9
8. (turn_to satellite2 phenomenon9 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 9
9. (turn_to satellite0 groundstation2 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 9
10. (take_image satellite2 phenomenon9 instrument6 image0)
   added: (have_image phenomenon9 image0)
   goals met: 3 of 9
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 9
12. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 3 of 9
13. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 9
14. (take_image satellite0 phenomenon10 instrument0 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 4 of 9
15. (turn_to satellite0 planet11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet11)
   goals met: 4 of 9
16. (take_image satellite0 planet11 instrument0 thermograph4)
   added: (have_image planet11 thermograph4)
   goals met: 5 of 9
17. (turn_to satellite0 star7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star7)
   goals met: 5 of 9
18. (take_image satellite0 star7 instrument0 thermograph4)
   added: (have_image star7 thermograph4)
   goals met: 6 of 9
19. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 6 of 9
20. (take_image satellite0 star8 instrument0 thermograph4)
   added: (have_image star8 thermograph4)
   goals met: 7 of 9
21. (turn_to satellite0 groundstation5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation5)
   goals met: 8 of 9
22. (turn_to satellite1 groundstation3 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation3)
   goals met: 9 of 9
